Lingjia007/STM32F407_Bootloader/IAP/menu.c
  while (total_written < flash_size)
  {
    uint32_t to_write = sizeof(buffer);
    if (flash_size - total_written < to_write)
      to_write = flash_size - total_written;

    memcpy(buffer, (uint8_t *)(flash_addr + total_written), to_write);
    bytes_written = lfs_file_write(&lfs, &file, buffer, to_write);
    if (bytes_written != to_write)
    {
      menu_service_println(&g_menu_ctx, "Error: Write failed!");
      lfs_file_close(&lfs, &file);
      lfs_spi_flash_unmount(&lfs);
      return;
    }

    total_written += to_write;
    if ((total_written % 4096) == 0 || total_written == flash_size)
    {
      snprintf(msg, sizeof(msg), "Progress: %u / %u bytes\r", (unsigned int)total_written, (unsigned int)flash_size);
      menu_service_print(&g_menu_ctx, msg);
    }
  }

  lfs_file_close(&lfs, &file);
  lfs_spi_flash_unmount(&lfs);
  menu_service_println(&g_menu_ctx, "\rImage stored successfully!");
}

static void cmd_store_from_tf(menu_ctx_t *ctx, int argc, char *argv[])
{
  StoreFromTFCard();
}

static void cmd_store_from_flash(menu_ctx_t *ctx, int argc, char *argv[])
{
  StoreFromInternalFlash();
}

static void cmd_show_stored(menu_ctx_t *ctx, int argc, char *argv[])
{
  lfs_t lfs;
  int res;

  res = lfs_spi_flash_init();
  if (res != 0)
  {
    menu_service_println(ctx, "Error: SPI Flash init failed!");
    return;
  }

  res = lfs_spi_flash_mount(&lfs);
  if (res != LFS_ERR_OK)
  {
    menu_service_println(ctx, "Error: Cannot mount SPI Flash!");
    return;
  }

  ShowStoredImages(&lfs);
  lfs_spi_flash_unmount(&lfs);
}

static void cmd_delete_stored(menu_ctx_t *ctx, int argc, char *argv[])
{
  lfs_t lfs;
  int res;

  res = lfs_spi_flash_init();
  if (res != 0)
  {
    menu_service_println(ctx, "Error: SPI Flash init failed!");
    return;
  }

  res = lfs_spi_flash_mount(&lfs);
  if (res != LFS_ERR_OK)
  {
    menu_service_println(ctx, "Error: Cannot mount SPI Flash!");
    return;
  }

  DeleteStoredImage(&lfs);
  lfs_spi_flash_unmount(&lfs);
}

static void cmd_delete_fs(menu_ctx_t *ctx, int argc, char *argv[])
{
  lfs_t lfs;
  int res;

  res = lfs_spi_flash_init();
  if (res != 0)
  {
    menu_service_println(ctx, "Error: SPI Flash init failed!");
    return;
  }

  res = lfs_spi_flash_mount(&lfs);
  if (res != LFS_ERR_OK)
  {
    menu_service_println(ctx, "Error: Cannot mount SPI Flash!");
    return;
  }

  DeleteEntireFS(&lfs);
  lfs_spi_flash_unmount(&lfs);
}

static void Print_Current_Time(void)
{
  platform_rtc_time_t rtc_time;
  platform_rtc_date_t rtc_date;
  char msg[128];

  if (RTC_GET_TIME(&g_rtc.base, &rtc_time) != RTC_STATUS_OK)
  {
    menu_service_println(&g_menu_ctx, "Failed to get RTC time!");
    return;
  }

  if (RTC_GET_DATE(&g_rtc.base, &rtc_date) != RTC_STATUS_OK)
  {
    menu_service_println(&g_menu_ctx, "Failed to get RTC date!");
    return;
  }

  if (rtc_date.year < 2025)
  {
    menu_service_println(&g_menu_ctx, "RTC time not set (year < 2025)");
    return;
  }

  snprintf(msg, sizeof(msg), "\rCurrent Time: %04d-%02d-%02d %02d:%02d:%02d (UTC+8)",
           rtc_date.year, rtc_date.month, rtc_date.date,
           rtc_time.hours, rtc_time.minutes, rtc_time.seconds);
  menu_service_println(&g_menu_ctx, msg);

  uint32_t timestamp;
  if (RTC_GET_TIMESTAMP(&g_rtc.base, &timestamp) == RTC_STATUS_OK)
  {
    snprintf(msg, sizeof(msg), "Unix Timestamp: %lu", (unsigned long)timestamp);
    menu_service_println(&g_menu_ctx, msg);
  }
}

static void cmd_esp8266_init(menu_ctx_t *ctx, int argc, char *argv[])
{
  menu_service_println(ctx, "Initializing ESP8266 and connecting to AP...");
  esp8266_ota_init();
}

static void cmd_esp8266_at_test(menu_ctx_t *ctx, int argc, char *argv[])
{
  menu_service_println(ctx, "Testing AT command...");
  if (esp8266_at_test() == ESP8266_EOK)
    menu_service_println(ctx, "AT test OK!");
  else
    menu_service_println(ctx, "AT test FAILED!");
}

static void cmd_esp8266_tcp_connect(menu_ctx_t *ctx, int argc, char *argv[])
{
  char server_ip[64];
  char server_port[8];
  char msg[128];
  uint8_t key = 0;
  uint8_t idx = 0;

  menu_service_print(ctx, "\r\nEnter server IP: ");
  idx = 0;
  menu_service_flush(ctx);
  while (1)
  {
    menu_service_getchar(ctx, &key, RX_TIMEOUT);
    if (key == '\r' || key == '\n')
    {
      server_ip[idx] = '\0';
      break;
    }
    else if (key == 0x08 || key == 0x7F)
    {
      if (idx > 0)
      {
        idx--;
        menu_service_print(ctx, "\b \b");
      }
    }
    else if (idx < sizeof(server_ip) - 1 && key >= 0x20 && key <= 0x7E)
    {
      server_ip[idx++] = key;
      char echo_ch[2] = {(char)key, '\0'};
      menu_service_print(ctx, echo_ch);
    }
  }

  menu_service_print(ctx, "\r\nEnter server port: ");
  idx = 0;
  menu_service_flush(ctx);
  while (1)
  {
    menu_service_getchar(ctx, &key, RX_TIMEOUT);
    if (key == '\r' || key == '\n')
    {
      server_port[idx] = '\0';
      break;
    }
    else if (key == 0x08 || key == 0x7F)
    {
      if (idx > 0)
      {
        idx--;
        menu_service_print(ctx, "\b \b");
      }
    }
    else if (idx < sizeof(server_port) - 1 && key >= '0' && key <= '9')
    {
      server_port[idx++] = key;
      char echo_ch[2] = {(char)key, '\0'};
      menu_service_print(ctx, echo_ch);
    }
  }

  snprintf(msg, sizeof(msg), "\r\nConnecting to %s:%s...", server_ip, server_port);
  menu_service_println(ctx, msg);

  if (esp8266_connect_tcp_server(server_ip, server_port) == ESP8266_EOK)
    menu_service_println(ctx, "TCP connect OK!");
  else
    menu_service_println(ctx, "TCP connect FAILED!");
}

static void cmd_esp8266_transparent_enter(menu_ctx_t *ctx, int argc, char *argv[])
{
  menu_service_println(ctx, "Entering transparent mode...");
  if (esp8266_enter_unvarnished() == ESP8266_EOK)
  {
    menu_service_println(ctx, "Transparent mode enabled!");
    menu_service_println(ctx, "You can now send data directly.");
  }
  else
    menu_service_println(ctx, "Enter transparent mode FAILED!");
}

static void cmd_esp8266_transparent_exit(menu_ctx_t *ctx, int argc, char *argv[])
{
  menu_service_println(ctx, "Exiting transparent mode...");
  esp8266_exit_unvarnished();
  menu_service_println(ctx, "Transparent mode exited.");
}

static void cmd_ota_target_internal(menu_ctx_t *ctx, int argc, char *argv[])
{
  menu_service_println(ctx, "Setting OTA target to Internal Flash...");
  ONENET_OTA_SetTargetType(0);
}

static void cmd_ota_target_sdcard(menu_ctx_t *ctx, int argc, char *argv[])
{
  menu_service_println(ctx, "Setting OTA target to SD Card (FATFS)...");
  ONENET_OTA_SetTargetType(1);
}

static void cmd_ota_target_spi(menu_ctx_t *ctx, int argc, char *argv[])
{
  menu_service_println(ctx, "Setting OTA target to SPI Flash (LFS)...");
  ONENET_OTA_SetTargetType(2);
}

static void cmd_onenet_ota_download(menu_ctx_t *ctx, int argc, char *argv[])
{
  menu_service_println(ctx, "Starting OneNET OTA download...");
  ONENET_OTA_ProcessUpgrade();
}

static void cmd_show_time(menu_ctx_t *ctx, int argc, char *argv[])
{
  Print_Current_Time();
}

static void cmd_mqtt_check_status(menu_ctx_t *ctx, int argc, char *argv[])
{
  char msg[256];
  char mqtt_cmd[256];

  menu_service_println(ctx, "Checking MQTT connection status...");
  snprintf(mqtt_cmd, sizeof(mqtt_cmd), "AT+MQTTCONN?");
  esp8266_uart_rx_restart();
  esp8266_uart_printf("%s\r\n", mqtt_cmd);

  uint32_t timeout = 2000;
  uint8_t *resp = NULL;
  while (timeout > 0)
  {
    resp = esp8266_uart_rx_get_frame();
    if (resp != NULL)
    {
      if (strstr((const char *)resp, "+MQTTCONN:") != NULL)
      {
        char *conn_line = strstr((const char *)resp, "+MQTTCONN:");
        if (conn_line != NULL)
        {
          char *server_start = strstr(conn_line, ",\"");
          if (server_start != NULL)
          {
            server_start += 2;
            if (*server_start == '"')
              menu_service_println(ctx, "MQTT: Not connected (server is empty)");
            else
            {
              menu_service_println(ctx, "MQTT: Connected");
              menu_service_println(ctx, conn_line);
            }
          }
          else
            menu_service_println(ctx, "MQTT: Not connected");
        }
        break;
      }
      else if (strstr((const char *)resp, "ERROR") != NULL)
      {
        menu_service_println(ctx, "MQTT: Not configured");
        break;
      }
      esp8266_uart_rx_restart();
    }
    timeout--;
    HAL_Delay(1);
  }
  if (timeout == 0)
    menu_service_println(ctx, "MQTT: Check timeout");
}

static void cmd_mqtt_configure(menu_ctx_t *ctx, int argc, char *argv[])
{
  mqtt_user_config_t config;
  char msg[256];
  uint8_t key = 0;
  uint8_t idx = 0;
  char input_buf[256];

