Lingjia007/STM32F407_Bootloader/IAP/menu.c
  memset(&config, 0, sizeof(config));
  strncpy(config.client_id, ONENET_DEVICE_NAME, sizeof(config.client_id) - 1);
  strncpy(config.username, ONENET_PRODUCT_ID, sizeof(config.username) - 1);

  menu_service_println(ctx, "\rPress '!' to use macro defaults, or Enter to customize...");
  snprintf(msg, sizeof(msg), "Default: client=%s, user=%s", config.client_id, config.username);
  menu_service_println(ctx, msg);

  menu_service_print(ctx, "\r\nEnter Client ID (or Enter for default): ");
  idx = 0;
  menu_service_flush(ctx);
  while (1)
  {
    menu_service_getchar(ctx, &key, RX_TIMEOUT);
    if (key == '\r' || key == '\n')
    {
      input_buf[idx] = '\0';
      break;
    }
    else if (key == '!' && idx == 0)
    {
      input_buf[0] = '!';
      input_buf[1] = '\0';
      menu_service_print(ctx, "!");
      break;
    }
    else if (key == 0x08 || key == 0x7F)
    {
      if (idx > 0)
      {
        idx--;
        menu_service_print(ctx, "\b \b");
      }
    }
    else if (idx < sizeof(input_buf) - 1 && key >= 0x20 && key <= 0x7E)
    {
      input_buf[idx++] = key;
      char echo_ch[2] = {(char)key, '\0'};
      menu_service_print(ctx, echo_ch);
    }
  }

  if (strcmp(input_buf, "!") == 0)
  {
    menu_service_println(ctx, "\rUsing macro defaults...");
    strncpy(config.client_id, ONENET_DEVICE_NAME, sizeof(config.client_id) - 1);
    strncpy(config.username, ONENET_PRODUCT_ID, sizeof(config.username) - 1);
    strncpy(config.password, ONENET_MQTT_TOKEN, sizeof(config.password) - 1);
  }
  else
  {
    if (idx > 0)
      strncpy(config.client_id, input_buf, sizeof(config.client_id) - 1);

    menu_service_print(ctx, "\r\nEnter Username (Product ID): ");
    idx = 0;
    menu_service_flush(ctx);
    while (1)
    {
      menu_service_getchar(ctx, &key, RX_TIMEOUT);
      if (key == '\r' || key == '\n')
      {
        input_buf[idx] = '\0';
        break;
      }
      else if (key == 0x08 || key == 0x7F)
      {
        if (idx > 0)
        {
          idx--;
          menu_service_print(ctx, "\b \b");
        }
      }
      else if (idx < sizeof(input_buf) - 1 && key >= 0x20 && key <= 0x7E)
      {
        input_buf[idx++] = key;
        char echo_ch[2] = {(char)key, '\0'};
        menu_service_print(ctx, echo_ch);
      }
    }
    if (idx > 0)
      strncpy(config.username, input_buf, sizeof(config.username) - 1);

    menu_service_print(ctx, "\r\nEnter Password (Token): ");
    idx = 0;
    menu_service_flush(ctx);
    while (1)
    {
      menu_service_getchar(ctx, &key, RX_TIMEOUT);
      if (key == '\r' || key == '\n')
      {
        input_buf[idx] = '\0';
        break;
      }
      else if (key == 0x08 || key == 0x7F)
      {
        if (idx > 0)
        {
          idx--;
          menu_service_print(ctx, "\b \b");
        }
      }
      else if (idx < sizeof(input_buf) - 1 && key >= 0x20 && key <= 0x7E)
      {
        input_buf[idx++] = key;
        char echo_ch[2] = {(char)key, '\0'};
        menu_service_print(ctx, echo_ch);
      }
    }
    if (idx > 0)
      strncpy(config.password, input_buf, sizeof(config.password) - 1);
  }

  snprintf(msg, sizeof(msg), "\rConfiguring MQTT user: client=%s, user=%s", config.client_id, config.username);
  menu_service_println(ctx, msg);

  if (esp8266_mqtt_usercfg(0, &config) == ESP8266_EOK)
    menu_service_println(ctx, "MQTT user config OK!");
  else
    menu_service_println(ctx, "MQTT user config FAILED!");
}

static void cmd_mqtt_connect(menu_ctx_t *ctx, int argc, char *argv[])
{
  char msg[256];
  char mqtt_cmd[256];
  char host[64] = ONENET_MQTT_HOST;
  uint16_t port = ONENET_MQTT_PORT;
  uint8_t key = 0;
  uint8_t idx = 0;
  char input_buf[128];

  menu_service_println(ctx, "Checking if already connected...");
  snprintf(mqtt_cmd, sizeof(mqtt_cmd), "AT+MQTTCONN?");
  esp8266_uart_rx_restart();
  esp8266_uart_printf("%s\r\n", mqtt_cmd);

  uint32_t timeout = 2000;
  uint8_t *resp = NULL;
  uint8_t already_connected = 0;

  while (timeout > 0)
  {
    resp = esp8266_uart_rx_get_frame();
    if (resp != NULL)
    {
      if (strstr((const char *)resp, "+MQTTCONN:") != NULL)
      {
        char *conn_line = strstr((const char *)resp, "+MQTTCONN:");
        if (conn_line != NULL)
        {
          char *server_start = strstr(conn_line, ",\"");
          if (server_start != NULL)
          {
            server_start += 2;
            if (*server_start != '"')
            {
              menu_service_println(ctx, "MQTT: Already connected!");
              menu_service_println(ctx, conn_line);
              already_connected = 1;
            }
          }
        }
        break;
      }
      esp8266_uart_rx_restart();
    }
    timeout--;
    HAL_Delay(1);
  }

  if (already_connected)
    return;

  menu_service_println(ctx, "Connecting to MQTT server...");
  snprintf(msg, sizeof(msg), "\r\nEnter MQTT server host (default: %s): ", host);
  menu_service_print(ctx, msg);
  idx = 0;
  menu_service_flush(ctx);
  while (1)
  {
    menu_service_getchar(ctx, &key, RX_TIMEOUT);
    if (key == '\r' || key == '\n')
    {
      input_buf[idx] = '\0';
      break;
    }
    else if (key == 0x08 || key == 0x7F)
    {
      if (idx > 0)
      {
        idx--;
        menu_service_print(ctx, "\b \b");
      }
    }
    else if (idx < sizeof(input_buf) - 1 && key >= 0x20 && key <= 0x7E)
    {
      input_buf[idx++] = key;
      char echo_ch[2] = {(char)key, '\0'};
      menu_service_print(ctx, echo_ch);
    }
  }
  if (idx > 0)
    strncpy(host, input_buf, sizeof(host) - 1);

  if (esp8266_mqtt_connect(0, host, port, 1) == ESP8266_EOK)
    menu_service_println(ctx, "MQTT connect OK!");
  else
    menu_service_println(ctx, "MQTT connect FAILED!");
}

static void cmd_mqtt_subscribe(menu_ctx_t *ctx, int argc, char *argv[])
{
  char msg[256];
  char topic[128];

  menu_service_println(ctx, "Subscribing to property topics...");

  snprintf(topic, sizeof(topic), "$sys/%s/%s/thing/property/post/reply", ONENET_PRODUCT_ID, ONENET_DEVICE_NAME);
  snprintf(msg, sizeof(msg), "Subscribing: %s", topic);
  menu_service_println(ctx, msg);
  esp8266_mqtt_subscribe(0, topic, 0);

