Lingjia007/STM32F407_Bootloader/IAP/menu.c
  snprintf(topic, sizeof(topic), "$sys/%s/%s/thing/property/set", ONENET_PRODUCT_ID, ONENET_DEVICE_NAME);
  snprintf(msg, sizeof(msg), "Subscribing: %s", topic);
  menu_service_println(ctx, msg);
  esp8266_mqtt_subscribe(0, topic, 0);

  snprintf(topic, sizeof(topic), "$sys/%s/%s/thing/property/desired/get/reply", ONENET_PRODUCT_ID, ONENET_DEVICE_NAME);
  snprintf(msg, sizeof(msg), "Subscribing: %s", topic);
  menu_service_println(ctx, msg);
  esp8266_mqtt_subscribe(0, topic, 0);

  snprintf(topic, sizeof(topic), "$sys/%s/%s/thing/property/desired/delete/reply", ONENET_PRODUCT_ID, ONENET_DEVICE_NAME);
  snprintf(msg, sizeof(msg), "Subscribing: %s", topic);
  menu_service_println(ctx, msg);
  esp8266_mqtt_subscribe(0, topic, 0);

  snprintf(topic, sizeof(topic), "$sys/%s/%s/thing/property/get", ONENET_PRODUCT_ID, ONENET_DEVICE_NAME);
  snprintf(msg, sizeof(msg), "Subscribing: %s", topic);
  menu_service_println(ctx, msg);
  esp8266_mqtt_subscribe(0, topic, 0);

  snprintf(topic, sizeof(topic), "$sys/%s/%s/ota/inform", ONENET_PRODUCT_ID, ONENET_DEVICE_NAME);
  snprintf(msg, sizeof(msg), "Subscribing: %s", topic);
  menu_service_println(ctx, msg);
  esp8266_mqtt_subscribe(0, topic, 0);
}

static void cmd_mqtt_publish(menu_ctx_t *ctx, int argc, char *argv[])
{
  mqtt_property_t prop;
  char msg[256];
  char msg_id[32] = "007";
  char type_buf[4];
  char value_buf[64];
  uint8_t key = 0;
  uint8_t idx = 0;

  memset(&prop, 0, sizeof(prop));

  menu_service_print(ctx, "\r\nEnter message ID (default: 007): ");
  idx = 0;
  menu_service_flush(ctx);
  while (1)
  {
    menu_service_getchar(ctx, &key, RX_TIMEOUT);
    if (key == '\r' || key == '\n')
    {
      msg_id[idx] = '\0';
      break;
    }
    else if (key == 0x08 || key == 0x7F)
    {
      if (idx > 0)
      {
        idx--;
        menu_service_print(ctx, "\b \b");
      }
    }
    else if (idx < sizeof(msg_id) - 1 && key >= 0x20 && key <= 0x7E)
    {
      msg_id[idx++] = key;
      char echo_ch[2] = {(char)key, '\0'};
      menu_service_print(ctx, echo_ch);
    }
  }
  if (idx == 0)
    strcpy(msg_id, "007");

  menu_service_print(ctx, "\r\nEnter property key (e.g. BSP_LED): ");
  idx = 0;
  menu_service_flush(ctx);
  while (1)
  {
    menu_service_getchar(ctx, &key, RX_TIMEOUT);
    if (key == '\r' || key == '\n')
    {
      prop.key[idx] = '\0';
      break;
    }
    else if (key == 0x08 || key == 0x7F)
    {
      if (idx > 0)
      {
        idx--;
        menu_service_print(ctx, "\b \b");
      }
    }
    else if (idx < sizeof(prop.key) - 1 && key >= 0x20 && key <= 0x7E)
    {
      prop.key[idx++] = key;
      char echo_ch[2] = {(char)key, '\0'};
      menu_service_print(ctx, echo_ch);
    }
  }

  menu_service_print(ctx, "\r\nEnter value type (0=int, 1=float, 2=bool, 3=string): ");
  idx = 0;
  menu_service_flush(ctx);
  while (1)
  {
    menu_service_getchar(ctx, &key, RX_TIMEOUT);
    if (key == '\r' || key == '\n')
    {
      type_buf[idx] = '\0';
      break;
    }
    else if (key >= '0' && key <= '9' && idx < sizeof(type_buf) - 1)
    {
      type_buf[idx++] = key;
      char echo_ch[2] = {(char)key, '\0'};
      menu_service_print(ctx, echo_ch);
    }
  }
  prop.value_type = (uint8_t)atoi(type_buf);

  menu_service_print(ctx, "\r\nEnter value: ");
  idx = 0;
  menu_service_flush(ctx);
  while (1)
  {
    menu_service_getchar(ctx, &key, RX_TIMEOUT);
    if (key == '\r' || key == '\n')
    {
      value_buf[idx] = '\0';
      break;
    }
    else if (key == 0x08 || key == 0x7F)
    {
      if (idx > 0)
      {
        idx--;
        menu_service_print(ctx, "\b \b");
      }
    }
    else if (idx < sizeof(value_buf) - 1 && key >= 0x20 && key <= 0x7E)
    {
      value_buf[idx++] = key;
      char echo_ch[2] = {(char)key, '\0'};
      menu_service_print(ctx, echo_ch);
    }
  }

  if (prop.value_type == MQTT_VALUE_TYPE_FLOAT)
    prop.value_float = atof(value_buf);
  else if (prop.value_type == MQTT_VALUE_TYPE_BOOL)
    prop.value_int = (strcmp(value_buf, "true") == 0 || strcmp(value_buf, "1") == 0) ? 1 : 0;
  else if (prop.value_type == MQTT_VALUE_TYPE_STRING)
    strncpy(prop.id, value_buf, sizeof(prop.id) - 1);
  else
    prop.value_int = atoi(value_buf);

  snprintf(msg, sizeof(msg), "\rPublishing: %s = %s (type=%d, id=%s)", prop.key, value_buf, prop.value_type, msg_id);
  menu_service_println(ctx, msg);

  if (esp8266_mqtt_publish_property(0, ONENET_PRODUCT_ID, ONENET_DEVICE_NAME, &prop, 1, msg_id) == ESP8266_EOK)
    menu_service_println(ctx, "Publish OK!");
  else
    menu_service_println(ctx, "Publish FAILED!");
}

static void cmd_mqtt_listen(menu_ctx_t *ctx, int argc, char *argv[])
{
  char msg[256];
  char recv_topic[128];
  char recv_payload[512];
  char recv_msg_id[32];
  uint8_t exit_q_count = 0;
  uint32_t exit_q_timer = 0;

  menu_service_println(ctx, "Listening for property set commands...");
  menu_service_println(ctx, "Press 'q' 3 times within 1 second to exit");

  while (1)
  {
    if ((huart4.Instance->SR & UART_FLAG_RXNE) != RESET)
    {
      uint8_t rx_char = (uint8_t)(huart4.Instance->DR & 0xFF);
      if (rx_char == 'q')
      {
        if (exit_q_count == 0 || (HAL_GetTick() - exit_q_timer) < 1000)
        {
          exit_q_count++;
          exit_q_timer = HAL_GetTick();
          if (exit_q_count >= 3)
          {
            menu_service_println(ctx, "Exiting listen mode...");
            break;
          }
        }
        else
        {
          exit_q_count = 1;
          exit_q_timer = HAL_GetTick();
        }
      }
      else
        exit_q_count = 0;
    }

    uint8_t *resp = esp8266_uart_rx_get_frame();
    if (resp != NULL)
    {
      if (strstr((const char *)resp, "+MQTTSUBRECV:") != NULL)
      {
        memset(recv_topic, 0, sizeof(recv_topic));
        memset(recv_payload, 0, sizeof(recv_payload));
        memset(recv_msg_id, 0, sizeof(recv_msg_id));

        if (esp8266_mqtt_check_property_set_recv(recv_topic, recv_payload, sizeof(recv_payload), recv_msg_id) == ESP8266_EOK)
        {
          snprintf(msg, sizeof(msg), "\rReceived: topic=%s", recv_topic);
          menu_service_println(ctx, msg);
          snprintf(msg, sizeof(msg), "Payload: %s", recv_payload);
          menu_service_println(ctx, msg);
          snprintf(msg, sizeof(msg), "Message ID: %s", recv_msg_id);
          menu_service_println(ctx, msg);

          if (strstr(recv_topic, "/thing/property/set") != NULL)
          {
            menu_service_println(ctx, "Auto replying to property set...");
            if (esp8266_mqtt_publish_set_reply(0, ONENET_PRODUCT_ID, ONENET_DEVICE_NAME, recv_msg_id, 200, "user_succ") == ESP8266_EOK)
              menu_service_println(ctx, "Reply sent successfully!");
            else
              menu_service_println(ctx, "Reply FAILED!");
          }
        }
      }
      esp8266_uart_rx_restart();
    }
    HAL_Delay(10);
  }
}

static void cmd_mqtt_disconnect(menu_ctx_t *ctx, int argc, char *argv[])
{
  menu_service_println(ctx, "Disconnecting MQTT...");
  if (esp8266_mqtt_disconnect(0) == ESP8266_EOK)
    menu_service_println(ctx, "MQTT disconnected!");
  else
    menu_service_println(ctx, "Disconnect FAILED!");
}

