Lingjia007/STM32F407_Bootloader/IAP/menu.c
static void cmd_mqtt_sync_time(menu_ctx_t *ctx, int argc, char *argv[])
{
  menu_service_println(ctx, "Syncing time from server...");
  if (ONENET_SyncTime())
  {
    menu_service_println(ctx, "Time sync success!");
    Print_Current_Time();
  }
  else
    menu_service_println(ctx, "Time sync FAILED!");
}

static void cmd_mqtt_publish_rtc(menu_ctx_t *ctx, int argc, char *argv[])
{
  char msg[256];
  char rtc_time_str[64];
  uint32_t publish_count = 0;
  uint8_t key = 0;

  menu_service_println(ctx, "Publishing RTC time every 1s...");
  menu_service_println(ctx, "Press 'q' or 'Q' to exit");

  while (1)
  {
    if (menu_service_getchar(ctx, &key, 10) > 0)
    {
      if (key == 'q' || key == 'Q')
      {
        menu_service_println(ctx, "Exiting RTC time publish mode...");
        snprintf(msg, sizeof(msg), "Total published: %lu times", (unsigned long)publish_count);
        menu_service_println(ctx, msg);
        break;
      }
    }

    platform_rtc_time_t rtc_time;
    platform_rtc_date_t rtc_date;

    if (RTC_GET_TIME(&g_rtc.base, &rtc_time) == RTC_STATUS_OK &&
        RTC_GET_DATE(&g_rtc.base, &rtc_date) == RTC_STATUS_OK)
    {
      snprintf(rtc_time_str, sizeof(rtc_time_str), "%04d-%02d-%02d %02d:%02d:%02d",
               rtc_date.year, rtc_date.month, rtc_date.date,
               rtc_time.hours, rtc_time.minutes, rtc_time.seconds);

      mqtt_property_t prop;
      memset(&prop, 0, sizeof(prop));
      strncpy(prop.key, "RTC_TIME", sizeof(prop.key) - 1);
      strncpy(prop.id, rtc_time_str, sizeof(prop.id) - 1);
      prop.value_type = MQTT_VALUE_TYPE_STRING;

      if (esp8266_mqtt_publish_property(0, ONENET_PRODUCT_ID, ONENET_DEVICE_NAME, &prop, 1, "007") == ESP8266_EOK)
      {
        publish_count++;
        snprintf(msg, sizeof(msg), "Published %lu times: %s", (unsigned long)publish_count, rtc_time_str);
        menu_service_println(ctx, msg);
      }
    }

    HAL_Delay(1000);
  }
}

static void cmd_decrypt_sdcard(menu_ctx_t *ctx, int argc, char *argv[])
{
  uint8_t key = 0;
  uint8_t selected = 0;
  uint8_t i;
  char msg[256];
  FRESULT res;
  int decrypt_result;
  char src_path[128];
  char dst_path[128];
  char *dot_pos;
  aes_decrypt_config_t decrypt_config = {
      .key = {0x8f, 0x8b, 0x6e, 0xcb, 0x07, 0x78, 0xa9, 0xb7,
              0x10, 0x97, 0x94, 0xb6, 0xe2, 0x31, 0xcd, 0xf3,
              0xc3, 0x40, 0x2e, 0x1d, 0x4f, 0x2a, 0xa3, 0x14,
              0xe0, 0x56, 0x60, 0x16, 0xac, 0xe4, 0x5c, 0xe0},
      .iv = {0xc1, 0xb7, 0x95, 0x2d, 0x38, 0xe6, 0x0e, 0xbd,
             0x33, 0x30, 0x6d, 0xdf, 0x49, 0x2b, 0x7a, 0x58}};

  menu_service_println(ctx, "Initializing TF card...");
  res = f_mount(&SDFatFS, (TCHAR const *)SDPath, 1);
  if (res != FR_OK)
  {
    menu_service_print(ctx, "Error: SD card mount failed! Error code: ");
    menu_service_int2str((uint8_t *)msg, res);
    menu_service_println(ctx, msg);
    return;
  }

  menu_service_println(ctx, "Scanning for .bin.aes files...\r");
  scan_sd_card_files();

  uint8_t aes_file_count = 0;
  for (i = 0; i < file_count; i++)
  {
    size_t len = strlen(file_list[i]);
    if (len >= 8)
    {
      const char *ext = file_list[i] + len - 8;
      if (strcmp(ext, ".bin.aes") == 0 || strcmp(ext, ".BIN.AES") == 0)
      {
        snprintf(msg, sizeof(msg), "  [%d] %s", aes_file_count + 1, file_list[i]);
        menu_service_println(ctx, msg);
        aes_file_count++;
      }
    }
  }

  if (aes_file_count == 0)
  {
    menu_service_println(ctx, "No .bin.aes files found on SD card!");
    f_mount(NULL, (TCHAR const *)SDPath, 0);
    return;
  }

  menu_service_printf(ctx, "\r\nSelect file to decrypt (1-%d) or 'a' to abort: ", aes_file_count);
  menu_service_flush(ctx);

  while (1)
  {
    menu_service_getchar(ctx, &key, RX_TIMEOUT);
    if (key == 'a' || key == 'A')
    {
      menu_service_println(ctx, "\rAborted by user.");
      f_mount(NULL, (TCHAR const *)SDPath, 0);
      return;
    }
    if (key >= '1' && key <= '9')
    {
      selected = key - '0';
      if (selected >= 1 && selected <= aes_file_count)
        break;
    }
  }

  uint8_t aes_idx = 0;
  for (i = 0; i < file_count; i++)
  {
    size_t len = strlen(file_list[i]);
    if (len >= 8)
    {
      const char *ext = file_list[i] + len - 8;
      if (strcmp(ext, ".bin.aes") == 0 || strcmp(ext, ".BIN.AES") == 0)
      {
        aes_idx++;
        if (aes_idx == selected)
        {
          selected = i;
          break;
        }
      }
    }
  }

  snprintf(msg, sizeof(msg), "\rSelected: %s", file_list[selected]);
  menu_service_println(ctx, msg);

  snprintf(src_path, sizeof(src_path), "0:/%s", file_list[selected]);
  strncpy(dst_path, src_path, sizeof(dst_path) - 1);
  dst_path[sizeof(dst_path) - 1] = '\0';

  dot_pos = strstr(dst_path, ".bin.aes");
  if (dot_pos == NULL)
    dot_pos = strstr(dst_path, ".BIN.AES");
  if (dot_pos != NULL)
  {
    *dot_pos = '\0';
    strcat(dst_path, ".bin");
  }
  else
    strcat(dst_path, ".decrypted");

  snprintf(msg, sizeof(msg), "Output file: %s", dst_path);
  menu_service_println(ctx, msg);
  menu_service_println(ctx, "Starting decryption...");

  decrypt_result = aes_decrypt_file_fatfs(&SDFatFS, src_path, dst_path, &decrypt_config);

  if (decrypt_result > 0)
  {
    menu_service_println(ctx, "Decryption completed successfully!");
    snprintf(msg, sizeof(msg), "Decrypted size: %d bytes", decrypt_result);
    menu_service_println(ctx, msg);
    menu_service_println(ctx, "Output file saved to SD card.");
  }
  else
  {
    menu_service_print(ctx, "Decryption failed! Error code: ");
    menu_service_int2str((uint8_t *)msg, (uint32_t)(-decrypt_result));
    menu_service_println(ctx, msg);
  }

  f_mount(NULL, (TCHAR const *)SDPath, 0);
}

static void cmd_decrypt_download_sdcard(menu_ctx_t *ctx, int argc, char *argv[])
{
  uint8_t key = 0;
  uint8_t selected = 0;
  uint8_t i;
  char msg[256];
  FRESULT res;
  int decrypt_result;
  char src_path[128];
  aes_decrypt_config_t decrypt_config = {
      .key = {0x8f, 0x8b, 0x6e, 0xcb, 0x07, 0x78, 0xa9, 0xb7,
              0x10, 0x97, 0x94, 0xb6, 0xe2, 0x31, 0xcd, 0xf3,
              0xc3, 0x40, 0x2e, 0x1d, 0x4f, 0x2a, 0xa3, 0x14,
              0xe0, 0x56, 0x60, 0x16, 0xac, 0xe4, 0x5c, 0xe0},
      .iv = {0xc1, 0xb7, 0x95, 0x2d, 0x38, 0xe6, 0x0e, 0xbd,
             0x33, 0x30, 0x6d, 0xdf, 0x49, 0x2b, 0x7a, 0x58}};

  menu_service_println(ctx, "Initializing TF card...");
  res = f_mount(&SDFatFS, (TCHAR const *)SDPath, 1);
  if (res != FR_OK)
  {
    menu_service_print(ctx, "Error: SD card mount failed! Error code: ");
    menu_service_int2str((uint8_t *)msg, res);
    menu_service_println(ctx, msg);
    return;
  }

  menu_service_println(ctx, "Scanning for .bin.aes files...\r");
  scan_sd_card_files();

  uint8_t aes_file_count = 0;
  for (i = 0; i < file_count; i++)
  {
    size_t len = strlen(file_list[i]);
    if (len >= 8)
    {
      const char *ext = file_list[i] + len - 8;
      if (strcmp(ext, ".bin.aes") == 0 || strcmp(ext, ".BIN.AES") == 0)
      {
        snprintf(msg, sizeof(msg), "  [%d] %s", aes_file_count + 1, file_list[i]);
        menu_service_println(ctx, msg);
        aes_file_count++;
      }
    }
  }

