Lingjia007/STM32F407_Bootloader/IAP/menu.c
  patch_result = hpatch_upgrade(&config);

  if (patch_result == HPATCH_OK)
  {
    menu_service_println(ctx, "HPatch upgrade completed successfully!");
    menu_service_println(ctx, "Upgraded firmware saved to SPI Flash.");
    snprintf(msg, sizeof(msg), "Output: %s", config.out_path);
    menu_service_println(ctx, msg);
  }
  else
  {
    menu_service_print(ctx, "HPatch upgrade failed! Error: ");
    menu_service_println(ctx, hpatch_err_to_string(patch_result));
  }

  lfs_spi_flash_unmount(&lfs);
}

MENU_TABLE(mqtt_menu) = {
    MENU_ITEM_CMD("1", "Check MQTT Connection Status", "Query current MQTT connection", cmd_mqtt_check_status),
    MENU_ITEM_CMD("2", "Configure MQTT User", "Set client ID, username, password", cmd_mqtt_configure),
    MENU_ITEM_CMD("3", "Connect to MQTT Server", "Connect to OneNET MQTT broker", cmd_mqtt_connect),
    MENU_ITEM_CMD("4", "Subscribe Property Topics", "Subscribe to all property topics", cmd_mqtt_subscribe),
    MENU_ITEM_CMD("5", "Publish Property", "Publish a single property value", cmd_mqtt_publish),
    MENU_ITEM_CMD("6", "Listen & Auto Reply Property Set", "Listen for property set commands", cmd_mqtt_listen),
    MENU_ITEM_CMD("7", "Disconnect MQTT", "Disconnect from MQTT broker", cmd_mqtt_disconnect),
    MENU_ITEM_CMD("8", "Sync Time (SNTP)", "Synchronize RTC from NTP server", cmd_mqtt_sync_time),
    MENU_ITEM_CMD("9", "Publish RTC Time (1s interval)", "Publish RTC time periodically", cmd_mqtt_publish_rtc),
    MENU_ITEM_BACK(),
    MENU_TABLE_END};

MENU_TABLE(esp8266_menu) = {
    MENU_ITEM_CMD("1", "WiFi Init & Connect AP", "Initialize ESP8266 and connect", cmd_esp8266_init),
    MENU_ITEM_CMD("2", "AT Command Test", "Test ESP8266 AT communication", cmd_esp8266_at_test),
    MENU_ITEM_CMD("3", "TCP Connect Test", "Connect to TCP server", cmd_esp8266_tcp_connect),
    MENU_ITEM_CMD("4", "Enter Transparent Mode", "Enable transparent transmission", cmd_esp8266_transparent_enter),
    MENU_ITEM_CMD("5", "Exit Transparent Mode", "Disable transparent transmission", cmd_esp8266_transparent_exit),
    MENU_ITEM_CMD("6", "Set OTA Target: Internal Flash", "OTA downloads to internal flash", cmd_ota_target_internal),
    MENU_ITEM_CMD("7", "Set OTA Target: SD Card (FATFS)", "OTA downloads to SD card", cmd_ota_target_sdcard),
    MENU_ITEM_CMD("8", "Set OTA Target: SPI Flash (LFS)", "OTA downloads to SPI flash", cmd_ota_target_spi),
    MENU_ITEM_CMD("9", "OneNET OTA Download", "Start OTA download from OneNET", cmd_onenet_ota_download),
    MENU_ITEM_CMD("A", "Show Current Time", "Display RTC time and timestamp", cmd_show_time),
    MENU_ITEM_SUBMENU("B", "MQTT Test Menu", "MQTT protocol testing", mqtt_menu, sizeof(mqtt_menu) / sizeof(mqtt_menu[0]) - 1),
    MENU_ITEM_BACK(),
    MENU_TABLE_END};

MENU_TABLE(store_menu) = {
    MENU_ITEM_CMD("1", "Store image from TF card", "Copy from SD to SPI Flash", cmd_store_from_tf),
    MENU_ITEM_CMD("2", "Store image from Flash", "Copy from internal Flash to SPI Flash", cmd_store_from_flash),
    MENU_ITEM_CMD("3", "Show stored images", "List images in SPI Flash", cmd_show_stored),
    MENU_ITEM_CMD("4", "Delete stored image", "Remove image from SPI Flash", cmd_delete_stored),
    MENU_ITEM_CMD("5", "Delete entire file system", "Format SPI Flash", cmd_delete_fs),
    MENU_ITEM_BACK(),
    MENU_TABLE_END};

MENU_TABLE(download_menu) = {
    MENU_ITEM_CMD("1", "Download via Serial (Ymodem)", "Receive firmware via Ymodem", cmd_serial_download),
    MENU_ITEM_CMD("2", "Download from SD card (FATFS)", "Read firmware from SD card", cmd_sdcard_download),
    MENU_ITEM_CMD("3", "Download from SPI Flash (LittleFS)", "Read firmware from SPI Flash", cmd_spi_flash_download),
    MENU_ITEM_BACK(),
    MENU_TABLE_END};

MENU_TABLE(decrypt_menu) = {
    MENU_ITEM_CMD("1", "Decrypt from SD card and download to Flash", "Decrypt .bin.aes and write to Flash", cmd_decrypt_download_sdcard),
    MENU_ITEM_CMD("2", "Decrypt from SPI Flash and download to Flash", "Decrypt .bin.aes and write to Flash", cmd_decrypt_download_spi),
    MENU_ITEM_BACK(),
    MENU_TABLE_END};

MENU_TABLE(hpatch_menu) = {
    MENU_ITEM_CMD("1", "HPatch upgrade from SD card", "Apply .hdiff patch from SD card", cmd_hpatch_sdcard),
    MENU_ITEM_CMD("2", "HPatch upgrade from SPI Flash", "Apply .hdiff patch from SPI Flash", cmd_hpatch_spi),
    MENU_ITEM_BACK(),
    MENU_TABLE_END};

MENU_TABLE(main_menu) = {
    MENU_ITEM_SUBMENU("1", "Download image to internal Flash", "Firmware download options", download_menu, sizeof(download_menu) / sizeof(download_menu[0]) - 1),
    MENU_ITEM_CMD("2", "Upload image from internal Flash", "Send firmware via Ymodem", cmd_serial_upload),
    MENU_ITEM_SUBMENU("3", "Store image to SPI-Flash LFS", "SPI Flash storage management", store_menu, sizeof(store_menu) / sizeof(store_menu[0]) - 1),
    MENU_ITEM_CMD("4", "Execute the loaded application", "Jump to application firmware", cmd_execute_app),
    MENU_ITEM_CMD("5", "Toggle Flash write protection", "Enable/disable write protection", cmd_flash_protection),
    MENU_ITEM_SUBMENU("6", "Decrypt and download encrypted firmware", "AES decryption options", decrypt_menu, sizeof(decrypt_menu) / sizeof(decrypt_menu[0]) - 1),
    MENU_ITEM_CMD("7", "Decrypt .bin.aes file on SD card", "Decrypt and save to SD card", cmd_decrypt_sdcard),
    MENU_ITEM_SUBMENU("8", "HPatch differential upgrade", "Differential firmware update", hpatch_menu, sizeof(hpatch_menu) / sizeof(hpatch_menu[0]) - 1),
    MENU_ITEM_CMD("9", "UART4 <-> USART1 Passthrough", "Transparent UART bridge", cmd_uart_passthrough),
    MENU_ITEM_SUBMENU("A", "ESP8266 WiFi & OTA Test", "WiFi and OTA testing", esp8266_menu, sizeof(esp8266_menu) / sizeof(esp8266_menu[0]) - 1),
    MENU_TABLE_END};

void Main_Menu(void)
{
  menu_service_init(&g_menu_ctx, (platform_uart_base_t *)&g_uart4_console.base);
  menu_service_set_root(&g_menu_ctx, main_menu, sizeof(main_menu) / sizeof(main_menu[0]) - 1);
  menu_service_set_prompt(&g_menu_ctx, "STM32F4xx IAP");

  menu_service_println(&g_menu_ctx, "\r\n======================================================================");
  menu_service_println(&g_menu_ctx, "=              (C) COPYRIGHT 2016 STMicroelectronics                 =");
  menu_service_println(&g_menu_ctx, "=                                                                    =");
  menu_service_println(&g_menu_ctx, "=          STM32F4xx In-Application Programming Application          =");
  menu_service_println(&g_menu_ctx, "=                                                                    =");
  menu_service_println(&g_menu_ctx, "=                       By MCD Application Team                      =");
  menu_service_println(&g_menu_ctx, "======================================================================");
  menu_service_println(&g_menu_ctx, "");

  menu_service_run(&g_menu_ctx);
}

/**
 * @}
 */
